namespace L17Task1
{
    /*
    Задание 2
    Используя Visual Studio, создайте проект по шаблону Console Application
    Представьте, что вы пишите приложение для Автостанции и вам необходимо создать простую
    коллекцию автомобилей со следующими данными: Марка автомобиля, модель, год выпуска, цвет. А
    также вторую коллекцию с моделью автомобиля, именем покупателя и его номером телефона.
    Используя простейший LINQ запрос, выведите на экран информацию о покупателе одного из
    автомобилей и полную характеристику приобретенной ними модели.
    */
    internal class Program
    {
        public static void Main(string[] args)
        {
        }
    }
}