namespace L14Task1
{
    /*
    Задание 2
    Используя Visual Studio, создайте проект по шаблону Console Application.
    Создайте коллекцию MyList<T>. Реализуйте в простейшем приближении возможность использования
    ее экземпляра аналогично экземпляру класса List<T>. Минимально требуемый интерфейс
    взаимодействия с экземпляром, должен включать метод добавления элемента, индексатор для
    получения значения элемента по указанному индексу и свойство только для чтения для получения
    общего количества элементов. Реализуйте возможность перебора элементов коллекции в цикле
    foreach. 
    */
    internal class Program
    {
        public static void Main(string[] args)
        {
        }
    }
}